PROVINCES = ["서울특별시", "부산광역시", "대구광역시", "인천광역시", "광주광역시", "대전광역시", "울산광역시", "세종특별자치시", "경기도", "강원도", "충청북도", "충청남도", "전라북도", "전라남도", "경상북도", "경상남도", "제주특별자치도", "비례대표"]

DISTRICTS = [
  ["종로", "중구성동갑", "중구성동을", "용산", "광진갑", "광진을", "동대문갑", "동대문을", "중랑갑", "중랑을", "성북갑", "성북을", "강북갑", "강북을", "도봉갑", "도봉을", "노원갑", "노원을", "노원병", "은평갑", "은평을", "서대문갑", "서대문을", "마포갑", "마포을", "양천갑", "양천을", "강서갑", "강서을", "강서병", "구로갑", "구로을", "금천", "영등포갑", "영등포을", "동작갑", "동작을", "관악갑", "관악을", "서초갑", "서초을", "강남갑", "강남을", "강남병", "송파갑", "송파을", "송파병", "강동갑", "강동을"],
  ["중구영도", "서구동구", "부산진갑", "부산진을", "동래", "남구갑", "남구을", "북구강서갑", "북구강서을", "해운대갑", "해운대을", "사하갑", "사하을", "금정", "연제", "수영", "사상", "기장"],
  ["중구남구", "동구갑", "동구을", "서구", "북구갑", "북구을", "수성갑", "수성을", "달서갑", "달서을", "달서병", "달성"],
  ["중구강화옹진", "동구미추홀갑", "동구미추홀을", "연수갑", "연수을", "남동갑", "남동을", "부평갑", "부평을", "계양갑", "계양을", "서구갑", "서구을"],
  ["동구남구갑", "동구남구을", "서구갑", "서구을", "북구갑", "북구을", "광산갑", "광산을"],
  ["동구", "중구", "서구갑", "서구을", "유성갑", "유성을", "대덕"],
  ["중구", "남구갑", "남구을", "동구", "북구", "울주"],
  ["세종갑", "세종을"],
  ["수원갑", "수원을", "수원병", "수원정", "수원무", "성남수정", "성남중원", "성남분당갑", "성남분당을", "의정부갑", "의정부을", "안양만안", "안양동안갑", "안양동안을", "부천갑", "부천을", "부천병", "부천정", "광명갑", "광명을", "평택갑", "평택을", "동두천연천", "안산상록갑", "안산상록을", "안산단원갑", "안산단원을", "고양갑", "고양을", "고양병", "고양정","의왕과천", "구리", "남양주갑", "남양주을", "남양주병", "오산", "시흥갑", "시흥을", "군포", "하남", "용인갑", "용인을", "용인병", "용인정", "파주갑", "파주을", "이천", "안성", "김포갑", "김포을", "화성갑", "화성을", "화성병", "광주갑", "광주을", "양주", "포천가평", "여주양평"],
  ["춘천철원화천양구갑", "춘천철원화천양구을", "원주갑", "원주을", "강릉", "동해태백삼척정선", "속초인제고성양양", "홍천횡성영월평창"],
  ["청주상당", "청주서원", "청주흥덕", "청주청원", "충주", "제천단양", "보은옥천영동괴산", "증평진천음성"],
  ["천안갑", "천안을", "천안병", "공주부여청양", "보령서천", "아산갑", "아산을", "서산태안", "논산계룡금산", "당진", "홍성예산"],
  ["전주갑", "전주을", "전주병", "군산", "익산갑", "익산을", "정읍고창", "남원임실순창", "김제부안", "완주진안무주장수"],
  ["목포", "여수갑", "여수을", "순천광양곡성구례갑", "순천광양곡성구례을", "나주화순", "담양함평영광장성", "고흥보성장흥강진", "해남완도진도", "영암무안신안"],
  ["포항북구", "포항남구울릉", "경주", "김천", "안동예천", "구미갑", "구미을", "영주영양봉화울진", "영천청도", "상주문경", "경산", "군위의성청송영덕", "고령성주칠곡"],
  ["창원의창", "창원성산", "창원마산합포", "창원마산회원", "창원진해", "진주갑", "진주을", "통영고성", "사천남해하동", "김해갑", "김해을", "밀양의령함안창녕", "거제", "양산갑", "양산을", "산청함양거창합천"],
  ["제주갑", "제주을", "서귀포"],
  ["비례대표"]
]

PARTIES = ["가자!평화인권당", "가자환경당", "공화당", "국가혁명배당금당", "국민새정당", "국민의당", "국민참여신당", "기독자유통일당", "기본소득당", "깨어있는시민연대당", "남북통일당", "노동당", "녹색당", "대한당", "대한민국당", "더불어민주당", "더불어시민당", "무소속", "미래당", "미래민주당", "미래통합당", "미래한국당", "민생당", "민중당", "민중민주당", "새누리당", "새벽당", "소속정당명", "여성의당", "열린민주당", "우리공화당", "우리당", "자영업당", "자유당", "정의당", "충청의미래당", "친박신당", "코리아", "통일민주당", "한국경제당", "한국복지당", "한나라당", "홍익당"]

PROVINCES.each_with_index do |province, i|
  p = Province.create(name: province)
  DISTRICTS[i].each do |district|
    District.create(name: district, province: p)
  end
end

PARTIES.each do |party|
  Party.create(name: party)
end